import React from 'react';
import './left Ad2.css'; // Ensure your CSS file path is correct
import NavImage from './Untitled-3.png';
import img from './IMG-20240621-WA0016.jpg';
import img2 from './IMG-20240621-WA0011.jpg';
import img3 from './IMG-20240621-WA0025.jpg';
import NewsAds from './adsection';
import RightNewsAds from '../rightadscomonent';
import NewsHeadlines from '../headlines';
import { Link } from 'react-router-dom';
import img1 from '../crops-ads/tomato.jpg';
import img4 from '../crops-ads/onion.jpg';
import img5 from '../crops-ads/Maize.jpg';
import img6 from '../crops-ads/carrot.jpg';
import img7 from '../crops-ads/Rice.jpg';
import img8 from '../crops-ads/potato.jpg';
import img9 from '../crops-ads/pea.jpg';
import img10 from '../crops-ads/Brinjal.jpg';
import img11 from '../crops-ads/Ladyfinger.jpg';
import { Outlet } from 'react-router-dom';

const StoryComponent = () => {
    return (
        <>
            <div className='layout'>
                <img src={NavImage} className="nav" alt="Navigation" />
                <div className='left-ads'>
                    <NewsAds />
                </div>
                
                <div className='left-crops'>
           <div className="Categories">
           <h2>Categories</h2>
           <div className="crop-item">
           <Link to="/left-crops/lc1"  target="_blank" rel="noopener noreferrer">
           <img src={img7}  alt="బాస్మతీ బియ్యం  సాగు విధానం " />
          <p>బాస్మతీ బియ్యం సాగు విధానం<br></br>
        (rice cultivation in telugu ) </p>
           </Link>
           </div>
           <div className='crop-item'>
           <Link to="/left-crops/lc2"  target="_blank" rel="noopener noreferrer">
           <img src={img5}  alt="మొక్కజొన్న సాగు విధానం " />
           <p>మొక్కజొన్న ఉత్పత్తి<br></br>
            (Maize cultivation in telugu)</p>
           </Link>
           </div>
           <div className='crop-item'>
           <Link to="/left-crops/lc3"  target="_blank" rel="noopener noreferrer">
           <img src={img11}  alt="బెండ సాగు విధానం " />
           <p>బెండ సాగు విధానం<br></br>
            (ladies finger cultivation in telugu)</p>
           </Link>
          </div>
          <div className='crop-item'>
           <Link to="/left-crops/lc4"  target="_blank" rel="noopener noreferrer">
           <img src="https://i0.wp.com/rythurajyam.com/wp-content/uploads/2021/12/Featured-photo-size1.jpg?resize=900%2C400&ssl=1"  alt="క్యాలీఫ్లవర్ సాగు విధానం"  />
           <p>క్యాలీఫ్లవర్ సాగు విధానం <br></br>
           (cauliflower cultivation in telugu)</p>
           </Link>
          </div>
          <div className='crop-item'>
           <Link to="/left-crops/lc5"  target="_blank" rel="noopener noreferrer">
           <img src={img8}  alt="క్యాలీఫ్లవర్ సాగు విధానం"  />
           <p>ఆలుగడ్డ సాగు విధానం<br></br>
           (Potato Cultivation in Telugu)</p>
           </Link>
          </div>
           </div>
           </div>
                <div className='content'>
                    <Outlet />
                    <div className="middle-content">
                    <h2>మామిడి మొక్కలు అంటు కడుతున్నం..</h2>
                    
                    <img src={img} className="logo" alt="Mango Plant" />

                    <p>
                        ఎండాకాలం వచ్చిందంటే చాలు.. మనం అందరి నోరూరుతూ ఉంటుంది. అదే ఫలాల రాజు మామిడి పండు తింటూ.. దాని రుచిని ఏడాదంతా ఆస్వాదించాలని పచ్చళ్లు పెట్టుకొని మరీ నిల్వ చేసుకుంటాం. మరి అంత రుచికరమైన మామిడి మొక్కని ఎలా తయారు చేస్తారో.. ఎలా అంటుకడతారో ఐటీడీఏ హార్టికల్చర్ అధికారి సందీప్ కుమార్ గారు రైతుబడితో వివరించారు.<br />
                        మామిడి పండు అంటే ఇష్టం ఉండని వాళ్లు ఎవరూ ఉండరు. కానీ చాలామందికి మామిడి మొక్కని ఎలా తయారు చేస్తారో తెలియదు. అలాగే చాలామంది రైతులు సరైన అంటుకట్టే విధానం తెలియక నష్టపోతుంటారు. వారందరూ ఈ నియమాలు పాటిస్తే ఉత్తమ ఫలితాలు సాధించవచ్చు.
                    </p>

                    <h2>అంటుకట్టడం ఎలా ..</h2>

                    <p>
                        ఉదాహరణకు బంగినపల్లి మామిడి మొక్కలు అంటుకడదామని అనుకున్నా. దానికి సుమారు 15-20 ఏళ్ల వయసున్న ఓ పెద్ద చెట్టుని చూసుకొని.. బాగా దిగుబడి వచ్చి.. చీడ పీడలు తక్కువగా వచ్చే ఆరోగ్యవంతమైన దానిని ఎంపిక చేసుకొని..పుల్లలు తీసుకువస్తాం. తెలంగాణ భాషలో చెప్పాలంటే పిక్కలు, టెంకలు, తిని పడేసిన పీచులను సేకరిస్తాం. కానీ అవి ఏ రకానికి చెందినవో మనకి తెలియదు. ఒక కవర్ తీసుకొని దానిలో మట్టి, వర్మీ కంపోస్టు, ఎరువు వేసి ఫాటింగ్ మీడియా అంటారు. ఆ టెంక మొలకొచ్చిన వెంటనే ఇందులో నాటుతాం. ఇలా రెండు నుంచి మూడు నెలల పాటు పెంచాలి.
                    </p>

                    <p>
                        కోరుకున్న రకం.. అంటుకట్టడమే..
                    </p>

                    <p>
                        కొంతమంది రైతులు వచ్చి నాకు బంగిన పల్లి, తోతాపురి, రసాలు ఇలా తమకు అవసరమైన రకాలను అడుగుతుంటారు. మేం దానికి మా వ్యవసాయ క్షేత్రంలో ఉంటే సరి. లేకుంటే రైతుల వద్దకు వెళ్లి పైన చెప్పిన నాణ్యమైన చెట్టుని ఎంపిక చేసుకొని వాటి పుల్లలు సేకరించి తీసుకువస్తాం. ఆ తర్వాత ఆ టెంకలకు, పుల్లలను కలిపి అంటుకడతాం.
                    </p>

                    <h2>ఎలా కడతాం అంటే…</h2>
                    <img src={img2} className="logo1" alt="Grafting Method" />

                    <p>
                        మామిడిలో అంటు కట్టే విధానాన్ని వినీర్ గ్రాఫ్టింగ్ అంటారు. వినీర్ అనే శాస్త్రవేత్త దీనిని సృష్టించారు కాబట్టి దీనికి ఈ పేరు పెట్టారు. ఈ విధానంలో ఏం చేస్తామంటే.. ఒక పుల్లను (సయాన్ స్టిక్) తీసుకొని దానిని రెండు వైపులా ‘వీ” ఆకారం వచ్చేలా కట్ చేసుకోవాలి. కణజాలం కనిపించేలా జాగ్రత్తలు తీసుకోవాలి. అలాగే మొలకెత్తిన టెంకల్లో కూడా ఒకటి లేదా రెండు ఆకులు ఉండేలా చూసుకోవాలి. అంతకంటే ఎక్కువ ఉంటే తీసేయాలి. అలా ఉంటే బలమంతా వాటి పోషణకే సరిపోతుంది. ఈ మొక్కను కూడా “వీ’ ఆకారంలోనే కత్తిరించాలి. ముందే కత్తిరించిన సయాన్ స్టిక్ ను దీనికి అనుసంధానించాలి. రెండు కూడా సమాన సైజులో ఉండేలా తగు జాగ్రత్తలు తీసుకోవాలి. ఆ తర్వాత ఓ గ్రాఫ్టింక్ పేపర్ ను తీసుకోవాలి. దీని గుణం ఏంటంటే తెగదు. ఎంతైనా సాగుతుంది. మనం అంటుకట్టిన తర్వాత రెండు నుంచి మూడు నెలల పాటు తెగకుండా ఉండాలి. అదే సమయంలో వర్షం పడినప్పుడు కూడా ఆ నీరు అంటుకట్టిన భాగంలోకి దిగకూడదు. కాబట్టి గ్రాఫ్టింగ్ పేపర్ ని వాడుతాం. అనుసంధానించిన సయాన్ స్టిక్ ను, మొక్కకు కలిపి గట్టిగా చుట్టాలి. గాలి, నీరు, వెలుతురు, వర్షం నీరు వెళ్లకుండా ఉండేంత బిగుతుగా చుట్టాలి. ఇలా కట్టిన వారం నుంచి పది రోజుల్లో దీని భవతవ్యం మనకి తెలిసిపోతుంది. అంతా సవ్యంగా ఉంటే దాదాపు 100 మొక్కలు అంటే కడితే 80 మొక్కలు వరకు విజయవంతం అయ్యే అవకాశం ఉంటుంది. వాతావరణం అనుకూలించక, మానవ తప్పిదాల కారణంగా, సరైన రూట్ స్టాక్, సయాన్ స్టిక్ లేక ఇతరత్రా కారణాల చేత అవి సఫలీకృతం అయ్యే అవకాశాలు తక్కువగా ఉంటాయి. వాటిని రెండు మూడు నెలల తర్వాత మళ్లీ అంటుకట్టుకోవచ్చు.
                    </p>

                    <h2>తగు జాగ్రత్తలు పాటించాలి..</h2>

                    <p>
                        రెండు నుంచి మూడు నెలల తర్వాత మొక్క నాటుకోవడానికి సిద్ధం అవుతుంది. ఈ క్రమంలో సాధ్యమైనంత వరకు రూట్ స్టాక్ ని కత్తిరంచే ప్రయత్నం చేస్తాం. దీనిని నాటిన తర్వాత ఒక ఏడాది పాటు రైతులు తగు జాగ్రత్తలు తీసుకోవాలి. ఒకవేళ దీని గుండా ఆకులు రావడం ప్రారంభం అయితే వెంటనే వాటిని తీసేయాలి. లేకపోతే ఆ పెరిగిన మొక్కని చంపేస్తాయి. ఎందుకంటే రూట్ స్టాక్ కన్నా సయాన్ స్టిక్ బలహీనంగా ఉంటుంది. వేసిన ఎరువును మొత్తం అదే గ్రహిస్తుంది. అందుకే ఎప్పటికప్పుడు దానిని కత్తిరిస్తూ దానిని ఎదగనివ్వకుండా చూడాలి. ఈ విషయం తెలియక రైతులు కొంతమంది మేం అడిగిన మొక్కలు ఇవ్వలేదు అని అడుగుతుంటారు. దీనికి కారణం అదే. వాళ్లు తగు జాగ్రత్తలు తీసుకోలేదని అర్థం.
                    </p>

                    <p>
                        సాధారణంగా అంటుకట్టిన మొక్కలు మూడు నుంచి నాలుగేళ్లలోపు పంటకు రావాలి. అంతకు మించి సమయం పడుతుంది అంటే అది అంటు మొక్క కాదు రూట్ స్టాక్ మొక్క అని భావించవచ్చు. అంటు కట్టిన తర్వాత నెలకొకటి చొప్పున శాఖలు కాస్తుంటాయి. వాటిని బట్టి ఇది ఎన్ని నెలల మొక్కో చెప్పేయొచ్చు. రూట్ స్టాక్ తయారు చేయడం మూడు నెలలు, అంటు కట్టిన తర్వాత మూడు నెలలు అంటే ఆరు నెలలు అయితే మొక్క నాటేందుకు సిద్ధం అవుతుంది.
                    </p>

                    <h2>రైతులు గుర్తించాల్సిన అంశాలు..</h2>
                    <img src={img3} className="logo1" alt="Important Points for Farmers" />

                    <p>
                        ఎవరైనా రైతు మామిడి మొక్కను కొనుగోలు చేసేందుకు వెళ్లినప్పుడు దాని వయసును కనుక్కోవాలి. రెండు నుంచి మూడేళ్ల వయసున్న మొక్క అయితే వాటిని కొనుగోలు చేయవద్దు. శాస్త్రీయంగా నిరూపితం అయిన దాని ప్రకారం ఏడాది నుంచి ఏడాదిన్నర మొక్కలే రైతుకి శ్రేయస్కరం. ఎందుకంటే నర్సరీలో వాడే సంచుల పరిమాణం చాలా చిన్నవిగా ఉంటాయి. దీని వేరు వ్యవస్థకి సహకరించే బలం దీనికి సరిపోదు. పది అంగుళాల ఉన్న బ్యాగు అయినా సరిపోతుంది. మరీ పెద్దది కూడా అవసరం లేదు. రెండేళ్లు దాటితే అంటు కట్టింది కూడా కనిపించదు. చిన్న వయసులో అయితే చిన్న గాయం కనిపిస్తుంది. అప్పుడు ఇది అంటు కట్టిన మొక్కగా గుర్తించవచ్చు. అలాగే మొక్కకు అంటు కట్టే సమయంలో చుట్టిన గ్రాఫ్టింక్ పేపర్ ని తీసేసి ఇవ్వాలి. ఒకవేళ మరచిపోయినా రైతులు అయినా వీటిని తొలగించుకోవచ్చు. ఇవి బిగుతుగా ఉండి మొక్కను ఎదగనీయవు.
                    </p>

                    <h2>ధరలు ఎలా ఉన్నాయి..</h2>

                    <p>
                        ఐడీడీయే నర్సరీ లో ఈ మొక్కల ధరలు 40-50 రూపాయల వరకు ఉంటాయి. ఒక్కో మొక్కను రైతులు సబ్సిడీ ద్వారా కూడా తీసుకోవచ్చు. అలా అయితే ఇంకాస్త తక్కువ ధరలో లభిస్తాయి. కాకపోతే ప్రతి రైతు ఎకరానికి 70 మొక్కలకు మించి ఈ పథకం కింద కొనుగోలు చేయలేరు. నర్సరీ నుంచి మామిడి మొక్కలను తరలించినప్పుడు సత్ప్రయోజనం. పెన్సిల్ టైపులో ఉంటాయి. కొంతమందికి పైన రెండు ఆకులు మాత్రమే ఉన్నాయని సందేహం వస్తుంది. ఇది సరైన విధానం కాబట్టి రైతులు దీనిపై ఎటువంటి ఆశ్చర్యం చెందకూడదు. మంచి వాతావరణం లో ఎప్పటికప్పుడు సేద్యం చేస్తే మంచి ఫలితాలు సాధించవచ్చు.
                    </p>
                   


                </div>
                </div>
               
                <div className='crops-ads'>
           <div className="recent-ads">
           <h2>Recent posts</h2>
           <div className="crop-item">
          <Link to="/crops-ads/c1"  target="_blank" rel="noopener noreferrer">
               <img src={img1}  alt="టమాటో సాగు విధానం " />
          <p>టమాటో సాగు విధానం.<br></br>
        (Tomato cultivation in telugu ) </p>
          </Link>
           </div>  
           <div className='crop-item'>
            <Link to="/crops-ads/c2" target="_blank" rel="noopener noreferrer">
            <img src={img6} alt="క్యారెట్ సాగు విధానం"  />
            <p>క్యారెట్ సాగు విధానం.<br></br>
                (Carrot cultivation in telugu )</p>
            </Link>
           </div>
           <div className='crop-item'>
            <Link to="/crops-ads/c3" target="_blank" rel="noopener noreferrer">
            <img src={img10}  alt=" వంకాయ సాగు విధానం "  />
            <p> వంకాయ సాగు విధానం.<br></br>
                (Brinjal Cultivation in telugu)</p>
            </Link>
           </div>
           <div className='crop-item'>
            <Link to="/crops-ads/c4" target="_blank" rel="noopener noreferrer">
            <img src={img4}  alt="ఉల్లి సాగు విధానం"  />
            <p>ఉల్లి సాగు విధానం<br></br>
                (Onion Cultivation in Telugu)</p>
            </Link>
           </div>
           <div className='crop-item'>
            <Link to="/crops-ads/c5" target="_blank" rel="noopener noreferrer">
            <img src={img9} alt=">కంది సాగు విధానం "  />
            <p>కంది సాగు విధానం<br></br>
            (Pigeon Pea Cultivation in Telugu)</p>
            
            

            </Link>
           </div>
           </div>
           </div>
        
                <div className="right-ads layout1">
                <RightNewsAds />
            </div>
            <div className='news'>
            <NewsHeadlines />
            </div>

               
            </div>
           
        </>
    );
};

export default StoryComponent;
